program b1z1;
var s,r: real;
begin
  writeln('Введите радиус окружности');
  read (r);
  s:= pi*r*r;
  writeln('Площадь окружности = ',s:5:3);
end.
  
  
  //Найти площадь круга по известному радиусу. 
  
  
  
 